@romanwuensche Hi, I tried your config, and it works ok for me. Here it is:
```terraform {
  required_providers {
    gridscale = {
      source = "gridscale/gridscale"
      version = "1.27.0"
    }
  }
}

resource "gridscale_k8s" "k8s_cluster" {
  name   = "k8s-tom-test"
  release = "1.29"

  node_pool {
    name = "k8s_cluster_node_pool"
    node_count = 2
    cores = 2
    memory = 4
    storage = 30
    storage_type = "storage_insane"
    rocket_storage = 90
  }
}
```

and the terminal log:
```
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # gridscale_k8s.k8s_cluster will be created
  + resource "gridscale_k8s" "k8s_cluster" {
      + audit_log_enabled          = (known after apply)
      + audit_log_level            = (known after apply)
      + change_time                = (known after apply)
      + create_time                = (known after apply)
      + id                         = (known after apply)
      + k8s_private_network_uuid   = (known after apply)
      + kube_apiserver_log_enabled = (known after apply)
      + kubeconfig                 = (sensitive value)
      + listen_port                = (known after apply)
      + log_delivery               = (known after apply)
      + log_delivery_access_key    = (known after apply)
      + log_delivery_bucket        = (known after apply)
      + log_delivery_endpoint      = (known after apply)
      + log_delivery_interval      = (known after apply)
      + log_delivery_secret_key    = (known after apply)
      + name                       = "k8s-tom-test"
      + network_uuid               = (known after apply)
      + oidc_ca_pem                = (known after apply)
      + oidc_client_id             = (known after apply)
      + oidc_enabled               = (known after apply)
      + oidc_groups_claim          = (known after apply)
      + oidc_groups_prefix         = (known after apply)
      + oidc_issuer_url            = (known after apply)
      + oidc_required_claim        = (known after apply)
      + oidc_signing_algs          = (known after apply)
      + oidc_username_claim        = (known after apply)
      + oidc_username_prefix       = (known after apply)
      + release                    = "1.29"
      + security_zone_uuid         = (known after apply)
      + service_template_uuid      = (known after apply)
      + status                     = (known after apply)
      + usage_in_minutes           = (known after apply)

      + node_pool {
          + cluster_cidr               = (known after apply)
          + cluster_traffic_encryption = false
          + cores                      = 2
          + memory                     = 4
          + name                       = "k8s_cluster_node_pool"
          + node_count                 = 2
          + rocket_storage             = 90
          + storage                    = 30
          + storage_type               = "storage_insane"
          + surge_node                 = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

gridscale_k8s.k8s_cluster: Creating...
gridscale_k8s.k8s_cluster: Still creating... [10s elapsed]
gridscale_k8s.k8s_cluster: Still creating... [20s elapsed]
gridscale_k8s.k8s_cluster: Still creating... [30s elapsed]
gridscale_k8s.k8s_cluster: Still creating... [40s elapsed]
gridscale_k8s.k8s_cluster: Still creating... [50s elapsed]
gridscale_k8s.k8s_cluster: Still creating... [1m0s elapsed]
gridscale_k8s.k8s_cluster: Still creating... [1m10s elapsed]
gridscale_k8s.k8s_cluster: Still creating... [1m20s elapsed]
gridscale_k8s.k8s_cluster: Still creating... [1m30s elapsed]
gridscale_k8s.k8s_cluster: Still creating... [1m40s elapsed]
gridscale_k8s.k8s_cluster: Still creating... [1m50s elapsed]
gridscale_k8s.k8s_cluster: Still creating... [2m0s elapsed]
....
```